In [1]:
# Pandas execise: Groupby
# Date:2020-10-07

In [2]:
import pandas as pd

In [3]:
drinks = pd.read_csv('./drinks.csv')

In [4]:
drinks.shape

(193, 6)

In [5]:
# The mean() of each continent
drinks.groupby(by='continent').beer_servings.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [6]:
# See the wine consumptions of each continent
# Need sorting
drinks.groupby('continent').wine_servings.describe().sort_values('count', ascending=False)

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

In [7]:
drinks.groupby('continent').mean()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,61.471698,16.339623,16.264151,3.007547
AS,37.045455,60.840909,9.068182,2.170455
EU,193.777778,132.555556,142.222222,8.617778
OC,89.687500,58.437500,35.625000,3.381250
SA,175.083333,114.750000,62.416667,6.308333

In [8]:
drinks.groupby('continent').median()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,32.0,3.0,2.0,2.30
AS,17.5,16.0,1.0,1.20
EU,219.0,122.0,128.0,10.00
OC,52.5,37.0,8.5,1.75
SA,162.5,108.5,12.0,6.85

In [9]:
drinks.groupby('continent').beer_servings.agg(['mean','min', 'max'])

                 mean  min  max
continent
AF          61.471698    0  376
AS          37.045455    0  247
EU         193.777778    0  361
OC          89.687500    0  306
SA         175.083333   93  333